# Текст який складається з 53 слів та 21-го розділового знаку
ryadok =  ( "Черепаха - аха-аха "
            "У воді сиділа-діла, "
            "Черепаха - аха-аха "
            "Свої ніжки мила-ила. "
            "Крокодили-дили-дили "
            "Пропливали-али-али, "
            "Черепаху-аху "
            "Налякали-али-али. "
            "Черепаха - аха-аха "
            "На камінчик сіла-іла, "
            "Черепаха - аха "
            "Перелякано тремтіла. "
            "Ну, а потім-отім-отім "
            "Піднялась на крила-ила "
            "І за хмари-ари-ари "
            "Полетіла-іла-іла. "
            "І маленькі діти знають: "
            "Черепахи не літають. "
            "А коли багато страху, "
            "То злетить і черепаха! "
            "Аха-аха-аха... ")


# Функція Денисенка Дениса first_change яка виконує три зміни рядка:
# 1 Замінює всі літери "Ч" на "4"
# 2 Робить першу літеру кожного слова великою
# 3 Рандомно змінює дефіси на один із символів
def first_change(input):
    # Заміна Ч на 4
    input = input.replace('Ч', '4')

    # Перетворення першої літери кожного слова у верхній регістр
    input = input.title()

    # Випадкова заміна дефісів на інші рандомні символи
    import random
    symbols = ["/", "+", "*"]
    input = input.replace("-", random.choice(symbols))

    return input

change_string = first_change(ryadok)

print("Result Denysenko:", change_string)


# Функція Кубуши Олексія, яка виконує три зміни рядка:
# 1. Замінює всі літери 'а' на ''
# 2. Робить кожне 3-тє слово великими літерами
# 3. Кожне 5-те слово стає цифрою 12345
def second_change(input_text):
    # 1. Видалення всіх літер 'а' (як великих, так і малих)
    input_text = input_text.replace('а', '').replace('А', '')

    # 2. Робимо кожне 3-тє слово великими літерами
    words = input_text.split()
    words = [word.upper() if (i + 1) % 3 == 0 else word for i, word in enumerate(words)]

    # 3. Кожне 5-те слово стає цифрою '12345'
    words = [word if (i + 1) % 5 != 0 else '12345' for i, word in enumerate(words)]

    return ' '.join(words)

# Застосування функції
change_string = second_change(ryadok)

print("Result Kubusha:", change_string)

# Функція Бобирєвой Тетяни, яка виконує три зміни рядка:
# 1. Замінює всі літери 'x' та 'Х' на '*'
# 2. Кожне 4 слово замінюється на слово 'Тетяна'
# 3. Всі літери стають великими
def third_change(input_text):
    # 1. Замінюємо всі літери 'х' на '*'
    input_text = input_text.replace('х', '*').replace('Х', '*')

    # 2. Розбиваємо текст на слова. Кожне 4-те слово замінюємо на "Тетяна"
    words = input_text.split()
    words = ["Тетяна" if (i + 1) % 4 == 0 else word for i, word in enumerate(words)]

    # 4. Робимо всі літери великими
    result = ' '.join(words).upper()

    return result

# Використання функції
test_string = third_change(ryadok)

print("Result Bobyrieva:", test_string)