# Текст який складається з 53 слів та 21-го розділового знаку
ryadok =  ( "Черепаха - аха-аха "
            "У воді сиділа-діла, "
            "Черепаха - аха-аха "
            "Свої ніжки мила-ила. "
            "Крокодили-дили-дили "
            "Пропливали-али-али, "
            "Черепаху-аху "
            "Налякали-али-али. "
            "Черепаха - аха-аха "
            "На камінчик сіла-іла, "
            "Черепаха - аха "
            "Перелякано тремтіла. "
            "Ну, а потім-отім-отім "
            "Піднялась на крила-ила "
            "І за хмари-ари-ари "
            "Полетіла-іла-іла. "
            "І маленькі діти знають: "
            "Черепахи не літають. "
            "А коли багато страху, "
            "То злетить і черепаха! "
            "Аха-аха-аха... ")

# Функція Денисенка Дениса first_change яка виконує три зміни рядка:
# 1 Замінює всі літери "Ч" на "4"
# 2 Робить першу літеру кожного слова великою
# 3 Рандомно змінює дефіси на один із символів
def first_change(input):
    # Заміна Ч на 4
    input = input.replace('Ч', '4')

    # Перетворення першої літери кожного слова у верхній регістр
    input = input.title()

    # Випадкова заміна дефісів на інші рандомні символи
    import random
    symbols = ["/", "+", "*"]
    input = input.replace("-", random.choice(symbols))
    
    return input

change_string = first_change(ryadok)

print("Result:", change_string)